Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/svd/PIC32CZ4010CA91208.svd
            <register>
               <name>PSR</name>
               <description>Protocol Status</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000707</resetValue>
               <fields>
                  <field>
                     <name>LEC</name>
                     <description>Last Error Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LECSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUFF</name>
                           <description>Stuff Error</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORM</name>
                           <description>Form Error</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACK</name>
                           <description>Ack Error</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT1</name>
                           <description>Bit1 Error</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT0</name>
                           <description>Bit0 Error</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC</name>
                           <description>CRC Error</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NC</name>
                           <description>No Change</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ACTSelect</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Node is synchronizing on CAN communication</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Node is neither receiver nor transmitter</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX</name>
                           <description>Node is operating as receiver</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX</name>
                           <description>Node is operating as transmitter</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EP</name>
                     <description>Error Passive</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EW</name>
                     <description>Warning Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BO</name>
                     <description>Bus_Off Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLEC</name>
                     <description>Data Phase Last Error Code</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DLECSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUFF</name>
                           <description>Stuff Error</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORM</name>
                           <description>Form Error</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACK</name>
                           <description>Ack Error</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT1</name>
                           <description>Bit1 Error</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT0</name>
                           <description>Bit0 Error</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC</name>
                           <description>CRC Error</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NC</name>
                           <description>No Change</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESI</name>
                     <description>ESI flag of last received CAN FD Message</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RBRS</name>
                     <description>BRS flag of last received CAN FD Message</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFDF</name>
                     <description>Received a CAN FD Message</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PXE</name>
                     <description>Protocol Exception Event</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDCV</name>
                     <description>Transmitter Delay Compensation Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TDCR</name>
               <description>Extended ID Filter Configuration</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TDCF</name>
                     <description>Transmitter Delay Compensation Filter Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>TDCO</name>
                     <description>Transmitter Delay Compensation Offset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IR</name>
               <description>Interrupt</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RF0N</name>
                     <description>Rx FIFO 0 New Message</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0W</name>
                     <description>Rx FIFO 0 Watermark Reached</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0F</name>
                     <description>Rx FIFO 0 Full</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0L</name>
                     <description>Rx FIFO 0 Message Lost</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1N</name>
                     <description>Rx FIFO 1 New Message</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1W</name>
                     <description>Rx FIFO 1 Watermark Reached</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1F</name>
                     <description>Rx FIFO 1 FIFO Full</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1L</name>
                     <description>Rx FIFO 1 Message Lost</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM</name>
                     <description>High Priority Message</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC</name>
                     <description>Timestamp Completed</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCF</name>
                     <description>Transmission Cancellation Finished</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFE</name>
                     <description>Tx FIFO Empty</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFN</name>
                     <description>Tx Event FIFO New Entry</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFW</name>
                     <description>Tx Event FIFO Watermark Reached</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFF</name>
                     <description>Tx Event FIFO Full</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFL</name>
                     <description>Tx Event FIFO Element Lost</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSW</name>
                     <description>Timestamp Wraparound</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MRAF</name>
                     <description>Message RAM Access Failure</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOO</name>
                     <description>Timeout Occurred</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRX</name>
                     <description>Message stored to Dedicated Rx Buffer</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ELO</name>
                     <description>Error Logging Overflow</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP</name>
                     <description>Error Passive</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EW</name>
                     <description>Warning Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BO</name>
                     <description>Bus_Off Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDI</name>
                     <description>Watchdog Interrupt</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEA</name>
                     <description>Protocol Error in Arbitration Phase</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PED</name>
                     <description>Protocol Error in Data Phase</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARA</name>
                     <description>Access to Reserved Address</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
